Canvas/app/views/professors/mycourses.html.erb

<ul>
<% current_user.courses.each do |course| %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."professor_id" = ?  [["professor_id", 10]]