Canvas/app/views/professors/show.html.erb

SELECT "colleges".* FROM "colleges" INNER JOIN "courses" ON "colleges"."id" = "courses"."college_id" WHERE "courses"."professor_id" = ?  [["professor_id", 15]]
---
<ul>
<% @professor.colleges.each do |college| %>

SELECT "students".* FROM "students" INNER JOIN "registrations" ON "registrations"."student_id" = "students"."id" INNER JOIN "courses" ON "courses"."id" = "registrations"."course_id" WHERE "courses"."professor_id" = ?  [["professor_id", 6]]
---
<ul>
  <h2><% Student.joins(:courses).where(courses: {professor_id: @professor.id}).each do |student| %></h2>

SELECT "courses".* FROM "courses" WHERE "courses"."professor_id" = ?  [["professor_id", 6]]
---
<ul>
<% @professor.courses.each do |course| %>