Canvas/app/views/registrations/new.html.erb

<%= f.label(:course) %>
<%= f.grouped_collection_select(:course_id, College.order(:name), :courses, :name, :id, :name, {prompt: "Select a course"}) %>
---
SELECT "colleges".* FROM "colleges" ORDER BY "colleges"."name" ASC