Canvas/app/views/students/show.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "registrations" ON "courses"."id" = "registrations"."course_id" WHERE "registrations"."student_id" = ?  [["student_id", 12]]
---

<% @student.courses.each do |course| %>

SELECT "courses".* FROM "courses" INNER JOIN "registrations" ON "courses"."id" = "registrations"."course_id" WHERE "registrations"."student_id" = ?  [["student_id", 14]]
SELECT SUM("courses"."credit") FROM "courses" INNER JOIN "registrations" ON "registrations"."course_id" = "courses"."id" INNER JOIN "students" ON "students"."id" = "registrations"."student_id" WHERE "students"."id" = ?  [["id", 13]]
---

<h4>Total Credits: <%= Course.joins(:students).where({students: {id: @student.id}}).sum(:credit)%></h4>