Canvas/app/controllers/application_controller.rb

  def current_user
    if p_logged_in?
      return Professor.find(session[:professor_id])
    elsif s_logged_in?
      return Student.find(session[:student_id])
---
SELECT "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]