Canvas/app/controllers/courses_controller.rb

  def update
    @course.update(course_params)
---
UPDATE "courses" SET "credit" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["credit", 2], ["updated_at", "2020-08-19 15:45:22.194376"], ["id", 12]]

  def create
    Course.create(course_params)
---
INSERT INTO "courses" ("name", "description", "setting", "semester", "credit", "college_id", "professor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @course = Course.find(params[:id])
    Course.destroy_course(@course)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 11]]

  def find_course
    @course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]