Canvas/app/controllers/professors_controller.rb

  def index
    @professors = Professor.all
---
SELECT "professors".* FROM "professors"

  def show
    @professor = Professor.find(params[:id])
---
SELECT "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def create
    @professor =Professor.new(professor_params)
    if @professor.valid?
      @professor.save
---
INSERT INTO "professors" ("name", "subject", "username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)