Canvas/app/controllers/registrations_controller.rb

SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
    @registration = Registration.find(params[:id])

INSERT INTO "registrations" ("registration_number", "student_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["registration_number", 1597940817], ["student_id", 12], ["course_id", 7], ["created_at", "2020-08-20 16:27:00.854911"], ["updated_at", "2020-08-20 16:27:00.854911"]]
---
  def create
    Registration.create(registration_params)

DELETE FROM "registrations" WHERE "registrations"."id" = ?  [["id", 11]]
---
   def destroy
    Registration.destroy(params[:id])