Canvas/app/controllers/sessions_controller.rb

  def process_login_student
    @student = Student.find_by(username: params[:username])
---
SELECT "students".* FROM "students" WHERE "students"."username" = ? LIMIT ?  [["username", "Abdullah1"], ["LIMIT", 1]]

  def process_login_professor
    @professor = Professor.find_by(username: params[:username])
---
SELECT "professors".* FROM "professors" WHERE "professors"."username" = ? LIMIT ?  [["username", "mansour1"], ["LIMIT", 1]]