Canvas/app/controllers/students_controller.rb

  def create
    @student =Student.new(student_params)
    if @student.valid?
      @student.save
---
INSERT INTO "students" ("name", "major", "username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)