Canvas/app/controllers/universities_controller.rb

SELECT "universities".* FROM "universities" ORDER BY "universities"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def about
    @university = University.first