Canvas/app/views/courses/edit.html.erb

<%= f.label(:college) %>
<%= f.collection_select(:college_id, College.all, :id, :name, {prompt: "Select College"}) %>
---
SELECT "colleges".* FROM "colleges"