Canvas/app/views/courses/new.html.erb

SELECT "colleges".* FROM "colleges"
---
    <%= f.label :college %>
    <%= f.collection_select :college_id, College.all, :id, :name, {prompt: "Select College"}, class: "form-control" %><br>