Canvas/app/views/courses/show.html.erb

SELECT "students".* FROM "students" INNER JOIN "registrations" ON "registrations"."student_id" = "students"."id" INNER JOIN "courses" ON "courses"."id" = "registrations"."course_id" WHERE "courses"."name" = ?  [["name", "web development"]]
---
<ul>
  <h2><% Student.joins(:courses).where(courses: {name: @course.name}).each do |student| %></h2>