Canvas/app/views/colleges/show.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."college_id" = ?  [["college_id", 3]]
---
<h3>Courses:</h3>
<ul> <% @college.courses.each do |course| %>

SELECT "professors".* FROM "professors" INNER JOIN "courses" ON "professors"."id" = "courses"."professor_id" WHERE "courses"."college_id" = ?  [["college_id", 3]]
---
<ul>
<% @college.professors.each do |professor| %>